In [1]:
import numpy as np
import pandas as pd 
import seaborn as sns

**Exercise 1: Create a DataFrame with 100 random integers between 1 and 100. Use .mean(), .median(), and .std() to compute basic descriptive statistics.**

In [2]:
random_data = np.random.randint(0, 101, size=(10, 10))
df = pd.DataFrame(random_data)
df

    0   1    2   3   4   5   6   7   8   9
0  98  35  100   5  47  92  65  75   8  64
1  33  33   67  61  95  14  70  85  68  66
2  74  64   12  45  58  66  31   6  93   7
3  82  91   21  75  62   9  29  40  40  80
4  22  10   78  25  57  10  78  78  31  32
5  22  19   66  74  40  99   9  85  69  46
6  98  69   20   6  75   5   5  57  41  96
7  64  49   60  58   5  28  70  14  78  39
8  87  20   42  14  96  25   7  34  41  86
9  39  41   73  36   6  50  12  29  97  54

In [3]:
df.mean()

0    61.9
1    43.1
2    53.9
3    39.9
4    54.1
5    39.8
6    37.6
7    50.3
8    56.6
9    57.0
dtype: float64

In [4]:
df.median()

0    69.0
1    38.0
2    63.0
3    40.5
4    57.5
5    26.5
6    30.0
7    48.5
8    54.5
9    59.0
dtype: float64

In [5]:
df.std()

0    30.431891
1    25.427238
2    28.972976
3    26.809824
4    31.490563
5    35.105555
6    29.948845
7    29.694930
8    28.825914
9    27.080128
dtype: float64

**Exercise 2: Load the tips dataset from seaborn (sns.load_dataset("tips")). Compute the mean, median, min, and max for the total_bill column**

In [6]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [7]:
tips_info = pd.DataFrame([tips['total_bill'].mean(), tips['total_bill'].median(), tips['total_bill'].min(), tips['total_bill'].max()], index=['Mean', 'Median', 'Min', 'max'])

In [8]:
tips_info.columns = ['Total Bill']

In [9]:
tips_info

        Total Bill
Mean     19.785943
Median   17.795000
Min       3.070000
max      50.810000

**Exercise 3. Using the tips dataset, group by day and calculate the average tip per day.**

In [10]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [11]:
days = tips.groupby('day', observed=False).tip.mean()
days

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

**Exercise 4: Generate a random DataFrame with two numeric columns (A, B) and one categorical column (Group with values "X", "Y"). Compute the mean of A and B for each group.**

In [12]:
df = pd.DataFrame({
    "A": np.random.randn(6),                
    "B": np.random.randint(1, 10, size=6),  
    "Group": ["X", "Y", "X", "Y", "X", "Y"] 
})
df['A'].mean()

-0.7881590912460132

In [13]:
df['B'].mean()

4.5

**Exercise 5: For the tips dataset, find the day with the highest median total_bill.**

In [14]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [15]:
highest = max(list(tips.groupby(['day'], observed=True).total_bill.median()))
highest

19.63

**Exercise 6: Create a Series with 20 values including some NaNs. Use .sum(), .mean(), and .describe() with and without skipna=False. Compare the results.**

In [16]:
data = pd.Series([
    10, 12, np.nan, 8, 15,
    20, np.nan, 25, 30, 18,
    22, 11, np.nan, 17, 19,
    21, 14, np.nan, 16, 24
])

In [17]:
data.sum()

282.0

In [18]:
data.sum(skipna=False) #This returns nan because of the nan values

nan

In [19]:
data.mean()

17.625

In [20]:
data.mean(skipna=False) #Same thing with .mean

nan

In [21]:
data.describe()

count    16.000000
mean     17.625000
std       5.976342
min       8.000000
25%      13.500000
50%      17.500000
75%      21.250000
max      30.000000
dtype: float64

**Exercise 7: For the tips dataset, use .describe() on both numeric and categorical columns. What’s the difference in the output?**

In [25]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [23]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [24]:
tips['size'].describe()

count    244.000000
mean       2.569672
std        0.951100
min        1.000000
25%        2.000000
50%        2.000000
75%        3.000000
max        6.000000
Name: size, dtype: float64

In [26]:
tips['sex'].describe()

count      244
unique       2
top       Male
freq       157
Name: sex, dtype: object

Conclusion: Categorical and numeric describe methods have different describe methods, and the most notable differences are that int series show numeric statistics, and categorical series show categorical statistics

**Exercise 8. Create a DataFrame with three numeric columns. Use .quantile([0.25, 0.5, 0.75]) to compute quartiles for each column.**

In [30]:
df = pd.DataFrame({
    'A': np.random.randint(1, 101, size=10),
    'B': np.random.randint(1, 101, size=10),
    'C': np.random.randint(1, 101, size=10)
})

In [31]:
df

    A   B   C
0  74  71  13
1   8  86  77
2  93  44  89
3  44  96   6
4  13  23  40
5  40   6  44
6  97  53  97
7  92  46  50
8  17  29  70
9  98  98  21

.quantile(): sorts the columns, and divides them into quantiles/equal-sized subgroups.

In [32]:
df.quantile([0.25, 0.5, 0.75])

          A      B      C
0.25  22.75  32.75  25.75
0.50  59.00  49.50  47.00
0.75  92.75  82.25  75.25

**Exercise 9: Load the tips dataset again and compute the standard deviation of tip grouped by smoker.**

In [33]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [34]:
tips.groupby('smoker')['tip'].std()

C:\Users\savin\AppData\Local\Temp\ipykernel_24440\2675601422.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips.groupby('smoker')['tip'].std()

smoker
Yes    1.401468
No     1.377190
Name: tip, dtype: float64

**Exercise 10. Write a one-liner to compute the correlation between total_bill and tip in the tips dataset.**

In [36]:
tips.total_bill.corr(tips.tip)

0.6757341092113645